Revit 2025 API
FramingShapeClassification Enumeration
 This enumeration is used to classify MEP Ancillary Framing shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FramingShapeClassification
Public Enumeration FramingShapeClassification
public enum class FramingShapeClassification
type FramingShapeClassification
Members
Member name | Value | Description
Linear | 0
Circular | 1
Oval | 2
Other | 3
See Also
Reference
Autodesk.Revit.DB Namespace